# -*- coding: utf-8 -*-
"""Lesson_4 DZ.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/github/koryagin2006/GB_Course_Methods_of_collecting_and_processing_data_from_the_network/blob/master/Lesson_4%20%D0%9F%D0%B0%D1%80%D1%81%D0%B8%D0%BD%D0%B3%20HTML.%20XPath/Lesson_4%20DZ.ipynb

# Задание

1. Написать приложение, которое собирает основные новости с сайтов `mail.ru, lenta.ru, yandex.news`
2. Сложить все новости в БД

Для парсинга использовать xpath. Структура данных должна содержать:
- название источника,
- наименование новости,
- ссылку на новость,
- дата публикации

### Подключение библиотек
"""

import requests
from pprint import pprint
from lxml import html
from pymongo import MongoClient
from datetime import datetime
import json


# Запуск сервера
try:
    client = MongoClient('localhost', 27017)
    print('connected successfully')
except:
    print('bad connection')

db = client['database_news']  # создание БД
news_from_3_sites = db.news_from_3_sites  # содание коллекции

"""### Проверка"""
from pandas import DataFrame

for i in news_from_3_sites.find({}):
    print(i)